Revit 2027 API
ThermalAsset.Permeability Property
 The permeability of the asset.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double Permeability { get; set; }
Public Property Permeability As Double
	Get
	Set
public:
property double Permeability {
	double get ();
	void set (double value);
}
member Permeability : float with get, set
Property Value
Double
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: The given value for permeability must be non-negative.
Remarks
 Values are in seconds per foot (s/ft) and must be non-negative.
See Also
Reference
ThermalAsset Class
Autodesk.Revit.DB Namespace